[
  {
    "title": "Does the guilty verdict destroy Trump or make him even stronger?",
    "description": "I opposed the Republican attempt to use the personal life of Bill Clinton to impeach him, and this attempt to use the personal life of Donald Trump to jail him ...",
    "opening": "NEW You can now listen to Fox News articles!\n\nThe verdict heard round the world will throw a lightning bolt into our politics as those on the left cheer and tho..."
  },
  {
    "title": "Affordability or Trump? What matters more to these voters",
    "description": "The fastest-growing big city in Canada has some serious growing pains, and it could have a major impact on the outcome of the federal election. With six seats u...",
    "opening": "Affordability or Trump? What matters more to these voters\n\nNews\n\nDuration 14:04\n\nThe fastest-growing big city in Canada has some serious growing pains, and it c..."
  },
  {
    "title": "Liz Cheney says Republicans face a choice: Trump or the Constitution",
    "description": "As the Jan. 6 committee continues to present its findings, Liz Cheney said Republicans face a choice between Trump and the Constitution.",
    "opening": "Rep. Liz Cheney (R-Wyo.) rattled off a list Wednesday night of what she considers the biggest threats facing the country, ranging from government regulation to ..."
  },
  {
    "title": "Opinion | Trump Exists, With or Without Television Cameras",
    "description": "The Constitution and our democracy do not bar him from running — yet CNN should not ask him tough questions?",
    "opening": "As a former executive of Fox News, I never expected to write this: CNN performed a valuable journalistic service this week by hosting a spirited town hall with ..."
  },
  {
    "title": "Conservatives warn Haley after Trump wins New Hampshire primary: 'Drop out or help Democrats'",
    "description": "Reactions on social media poured in on Tuesday night from conservatives, as well as President Biden, chiming in about what Trump's New Hampshire victory means g...",
    "opening": "Reactions quickly started pouring in on social media following former President Trump’s victory over former United Nations ambassador Nikki Haley in the New H..."
  },
  {
    "title": "Black Michigan voter tells NBC 'I don't hear' fascism or anger from Trump",
    "description": "Black Michigan voter and Trump supporter Allen Tomkowiak told an NBC News crew Sunday that he doesn’t believe claims that the former president is a fascist.",
    "opening": "One Black Michigan voter does not believe recent claims that former President Trump is a \"fascist.\"\n\nTrump voter Allen Tomkowiak spoke to an NBC News crew Sunda..."
  },
  {
    "title": "How Donald Trump uses dishonesty",
    "description": "The 2024 Republican front-runner has a robust record of deploying misinformation and lies. It’s useful to understand how he does so and why it works.",
    "opening": "Listen 8 min Share Comment Add to your saved stories Save\n\nYou don’t need to know a lot about Donald Trump to have a broad understanding of what motivates him..."
  },
  {
    "title": "Trump seeks to discuss classified information at or near Mar-a-Lago",
    "description": "Trump’s attorneys seek permission to allow him and his legal team to discuss sensitive information at a protected facility at or near his Mar-A-Lago residence...",
    "opening": "More on the Trump classified documents indictment\n\nThe latest: Donald Trump faces a new federal indictment in which he is charged with seeking to prevent securi..."
  },
  {
    "title": "Hackers falsely claim Donald Trump is dead after taking control of Trump Jr.'s X account",
    "description": "'I'm sad to announce, my father Donald Trump has passed away. I will be running for president in 2024,' read one of the since-deleted posts",
    "opening": "'I'm sad to announce, my father Donald Trump has passed away. I will be running for president in 2024,' read one of the since-deleted posts\n\nPranksters shared a..."
  },
  {
    "title": "Lindsey Graham urges McConnell truce, says Trump is 'indispensable' GOP leader, 'like it or not'",
    "description": "President Trump is the “captain” of the federal Republican “team” going into 2022, whether or not intraparty critics or detractors agree, Sen. Lindsey G...",
    "opening": "Former President Donald Trump is the \"captain\" of the Republican \"team\" going into 2022, whether or not intraparty critics or detractors agree, Sen. Lindsey Gra..."
  },
  {
    "title": "CNN host clashes with GOP lawmaker over Trump saying he'll protect women whether they 'like it or not'",
    "description": "CNN host John Berman and Rep. Byron Donalds, R-Fla., argued over a clip of former President Trump saying he'd protect women from migrant gangs whether they'd",
    "opening": "CNN anchor John Berman grilled Rep. Byron Donalds, R-Fla., over former President Trump’s recent comments that he will protect women whether they \"like it or n..."
  },
  {
    "title": "Donald Trump Jr., Ivanka Trump subpoenaed by NY attorney general in Trump Organization probe",
    "description": "New York Attorney General Letitia James recently issued subpoenas for former President Trump and his two eldest children in connection with a civil investigatio...",
    "opening": "NEW You can now listen to Fox News articles!\n\nNew York Attorney General Letitia James recently issued subpoenas for former President Donald Trump and his two el..."
  },
  {
    "title": "Teamsters union declines to endorse Trump or Harris for president",
    "description": "The International Brotherhood of Teamsters has declined to endorse Kamala Harris or Donald Trump for president, saying neither candidate has sufficient support ...",
    "opening": "WASHINGTON (AP) — The International Brotherhood of Teamsters declined Wednesday to endorse Kamala Harris or Donald Trump for president, saying neither candida..."
  },
  {
    "title": "'Justice' or 'Travesty'?: The interne erupts after Trump guilty verdict",
    "description": "A Manhattan jury ruled that former President Donald Trump was guilty on all 34 accounts of falsifying business records in the first degree Thursday afternoon.",
    "opening": "The internet erupted after a New York City jury found former President Trump guilty in his hush money trial on Thursday.\n\nTrump was found guilty on all 34 count..."
  },
  {
    "title": "Donald Trump does not understand democracy",
    "description": "The former president views leadership like a private business, not as a function of public trust.",
    "opening": "Listen 6 min Comment Gift Article Share\n\nFor decades, Donald Trump’s only boss was Donald Trump. As head of the Trump Organization, the real estate magnate di..."
  },
  {
    "title": "Riley Gaines mocks Mark Cuban for suggesting pro-Trump women aren't 'strong' or 'intelligent'",
    "description": "Former NCAA swimmer and OutKick contributor Riley Gaines called out billionaire Mark Cuban for comments about former President Trump never being seen around \"st...",
    "opening": "Billionaire Mark Cuban's recent comments about former President Trump never being seen around \"strong\" or \"intelligent\" women has earned him a frenzy of backlas..."
  },
  {
    "title": "J.D. Tuccille: Donald Trump, socialist",
    "description": "Many of the U.S. president’s recent economic moves extend state control over the economy",
    "opening": "Article content\n\nThere was a time, not so long ago, when you could assume a Republican administration in Washington D.C. would generally favour free markets —..."
  },
  {
    "title": "Republican rift exposes choice: With Trump or against him",
    "description": "NEW YORK (AP) — Senate Republicans blame the Republican National Committee. The RNC blames two Republican House members. They blame former President Donald Tr...",
    "opening": "Senate Minority Leader Mitch McConnell of Ky., arrives to speak to reporters on Capitol Hill in Washington, Tuesday, Feb. 8, 2022. Senate Republicans blame the ..."
  },
  {
    "title": "Adam Pankratz: Forget Trump or the Convoy, leftists are the real threat",
    "description": "When I was a child on camping trips I was always scared of bears. Young though I was, my zeal for a clean tent and procedural correctness with regards to bear?...",
    "opening": "This advertisement has not loaded yet, but your article continues below.\n\n'Am I really the best the Liberals can do?' Inside the thoughts of the federal grocery..."
  },
  {
    "title": "The veepstakes goes 'Apprentice': Will Trump really pick Rubio, Vance or Burgum?",
    "description": "FOX News' Howard Kurtz breaks down the three vying to be former President Trump's VP on the 2024 Republican ticket. Here's what to look for from Gov. Doug Burgu...",
    "opening": "For months, the media-industrial complex has churned out useless speculation about the veepstakes, much of it generated by the wannabe candidates themselves.\n\nO..."
  },
  {
    "title": "Trump answers whether Comey indictment is about justice or revenge",
    "description": "President Donald Trump says James Comey's indictment is “about justice, not revenge,",
    "opening": "NEW You can now listen to Fox News articles!\n\nPresident Donald Trump told reporters Friday that the indictment against former FBI Director James Comey is about ..."
  },
  {
    "title": "Robert De Niro warns on 'The View' that Trump could return to power like Hitler or Mussolini",
    "description": "Actor Robert De Niro slammed former President Trump in a guest appearance on ABC's",
    "opening": "Hollywood actor Robert De Niro warned on Tuesday that Donald Trump could \"change this country\" like fascist dictators did in Europe.\n\n\"I don’t understand why ..."
  },
  {
    "title": "Donald Trump deigns to see Black voters now",
    "description": "Trump deals with the Black population when they fit comfortably into his narrative, not when they challenge it",
    "opening": "Presidential candidate Donald Trump has been touting his newfound appeal to Black voters who wanted little to do with him in previous election cycles. It would ..."
  },
  {
    "title": "Republicans wary of using DEI against Harris as Trump jokes about her being 'Indian or black'",
    "description": "Republicans in Congress are pressing former President Trump not to rely on DEI politics to attack Vice President Harris following comments on Wednesday.",
    "opening": "Congressional Republicans are wary of using diversity, equity and inclusion politics to criticize Vice President Harris, with some urging former President Trump..."
  },
  {
    "title": "DA must step aside or remove prosecutor in Trump Georgia election interference case: judge",
    "description": "Fulton County District Attorney Fani Willis must step aside from the Georgia election interference case against Donald Trump or remove the special prosecutor wi...",
    "opening": "Fulton County District Attorney Fani Willis must step aside from the Georgia election interference case against Donald Trump or remove the special prosecutor wi..."
  },
  {
    "title": "Sean Collins: The persecution of Donald Trump",
    "description": "With this indictment, Democrats are dragging America into banana-republic territory.",
    "opening": "This latest attempt to take down Trump, an indictment brought by New York County district attorney Alvin Bragg, has the hallmarks of these earlier attempts. Onc..."
  },
  {
    "title": "'Significant' new evidence: NY attorney general describes possible fraud at Trump family business",
    "description": "Evidence suggested that Donald Trump and the Trump Organization had misstated the value of six properties, New York Attorney General Letitia James said in a…",
    "opening": "'Significant' new evidence: NY attorney general describes possible fraud at Trump family business\n\nEvidence suggested that Donald Trump and the Trump Organizati..."
  },
  {
    "title": "Tomi Lahren: Democrats know Biden would lose to Trump or DeSantis",
    "description": "Fox Nation host Tomi Lahren says Democrats will \"throw President Biden under the bus\" well before the 2024 presidential primaries.",
    "opening": "NEW You can now listen to Fox News articles!\n\nFox Nation host Tomi Lahren expressed her doubts Tuesday on \"Fox & Friends First\" about President Biden running fo..."
  },
  {
    "title": "Ivana Trump, first wife of Donald Trump, dies at 73",
    "description": "WASHINGTON — Donald Trump’s first wife Ivana Trump, 73, has died, the former U.S. president said on Thursday.",
    "opening": "Article content\n\nWASHINGTON — Donald Trump’s first wife Ivana Trump, 73, has died, the former U.S. president said on Thursday.\n\nWe apologize, but this video..."
  },
  {
    "title": "Donald Trump Jr, Ivanka Trump subpoenaed in New York probe -NYT",
    "description": "WASHINGTON — New York state’s attorney general has subpoenaed two of former President Donald Trump’s adult children, Donald Trump Jr. and Ivanka Trump, as...",
    "opening": "Article content\n\nWASHINGTON — New York state’s attorney general has subpoenaed two of former President Donald Trump’s adult children, Donald Trump Jr. and..."
  },
  {
    "title": "Donald Trump Has a Polling Problem",
    "description": "Most Republicans still support Trump. But the polls still suggest the federal indictment is hurting him.",
    "opening": "To be clear, Trump’s enduring support among Republicans is an important story. If it continues, he is likely to become the party’s nominee. That support is ..."
  },
  {
    "title": "Harvard vs. Trump, Did Elon Musk drain the swamp or drown in it and more",
    "description": "Read the latest from Fox News Opinion and watch videos from Laura Ingraham, Sean Hannity, Jesse Watters, Raymond Arroyo and more",
    "opening": "NEW You can now listen to Fox News articles!\n\nWelcome to the Fox News Opinion Newsletter.\n\nJESSE WATTERS - Fox News host gives his take on why Democrats are adm..."
  },
  {
    "title": "Donald Trump safe after gunshots reported",
    "description": "The White House said President Joe Biden and Vice President Kamala Harris, the Democratic presidential nominee, had both been briefed",
    "opening": "The White House said President Joe Biden and Vice President Kamala Harris, the Democratic presidential nominee, had both been briefed\n\nIt was not immediately cl..."
  },
  {
    "title": "U.S. voters split on whether Trump or Harris will make life more affordable",
    "description": "Americans are divided on which presidential candidate will make life better for middle and lower income families. Neither Donald Trump nor Kamala Harris has rel...",
    "opening": "In a sparsely furnished row house in north Philadelphia, Saiyda Bey gets comfortable on a grey chaise lounge. The home smells of incense and her black kitten, K..."
  },
  {
    "title": "Donald Trump compares himself to Mona Lisa",
    "description": "The 76-year-old billionaire is impressed by the dedication of his supporters",
    "opening": "The 76-year-old billionaire is impressed by the dedication of his supporters\n\nDonald Trump has compared himself to the Mona Lisa in a new TV interview.\n\nThis ad..."
  },
  {
    "title": "Ivana Trump, first wife of Donald Trump, dies at 73",
    "description": "WASHINGTON — Donald Trump’s first wife Ivana Trump, 73, has died, the former U.S. president said on Thursday.",
    "opening": "Article content\n\nWASHINGTON — Donald Trump’s first wife Ivana Trump, 73, has died, the former U.S. president said on Thursday.\n\nWe apologize, but this video..."
  },
  {
    "title": "Trump delivers ultimatum to Hamas: hostages home or pay the consequences",
    "description": "President Trump issues final warning to Hamas to release remaining hostages or face consequences as ceasefire negotiations continue to stall.",
    "opening": "NEW You can now listen to Fox News articles!\n\nPresident Donald Trump issued his \"last warning\" to Hamas to either release the remaining hostages or face the con..."
  },
  {
    "title": "Here’s where Trump has deployed National Guard troops – or is trying to",
    "description": "Some Republican mayors and governors have embraced the deployments. Some Democratic mayors have as well. But the effort is finding blowback in the courts, and t...",
    "opening": "President Donald Trump is trying to deploy National Guard members to cities across the United States in what he says is an attempt to combat “the war from wit..."
  },
  {
    "title": "Trump claims no 'lifts' or 'stands' will be allowed at debate with Kamala Harris",
    "description": "Former President Donald Trump claims that",
    "opening": "Former President Donald Trump claims that the upcoming presidential debate will not allow for adjustments to the nominees' height behind the podium.\n\nTrump made..."
  },
  {
    "title": "Is Biden more effective – or distracted – when taking on Trump?",
    "description": "Even many Democrats admit privately, if not publicly, that Joe Biden is in the White House today because of Donald Trump. In a normal election year, Biden proba...",
    "opening": "Even many Democrats admit privately, if not publicly, that Joe Biden is in the White House today because of Donald Trump.\n\nIn a normal election year, Biden prob..."
  },
  {
    "title": "What's behind sexual assault lawsuit against Donald Trump?",
    "description": "NEW YORK (AP) — As Donald Trump ran for and served as president, over a dozen women publicly accused him of sexual assault and harassment. Most of those claim...",
    "opening": "This advertisement has not loaded yet, but your article continues below.\n\nAdam Zivo: Former Green party leadership candidate goes to Moscow to whitewash war\n\nSo..."
  },
  {
    "title": "Donald Trump Jr., Ivanka Trump subpoenaed in New York probe",
    "description": "NEW YORK — New York’s attorney general has subpoenaed two of Donald Trump’s adult children, Donald Trump Jr and Ivanka Trump, as part of her civil probe i...",
    "opening": "James has also subpoenaed Trump. Lawyers for the Trump family are seeking to block her from questioning the former Republican president and his children, the fi..."
  },
  {
    "title": "Trump is back. Back again.",
    "description": "Former president Donald Trump has officially announced his bid for the White House in 2024. However, factions in the Republican Party aren’t sold on having Tr...",
    "opening": "Former president Donald Trump gestures after announcing another run for president Tuesday at Mar-a-Lago, in Palm Beach, Fla. (AP Photo/Andrew Harnik)\n\nTuesday n..."
  },
  {
    "title": "Is the right-wing press abandoning Donald Trump?",
    "description": "Following Tuesday’s midterm elections, a variety of right-wing publications had seemingly found themselves a new dauphin: Gov. Ron DeSantis.",
    "opening": "This advertisement has not loaded yet, but your article continues below.\n\nCOVID mask mandates may be coming back. Is there any point? Experts are divided\n\nIs th..."
  },
  {
    "title": "Trump must testify in New York probe, appeals court rules",
    "description": "Former U.S. President Donald Trump must testify under oath in the New York Attorney General’s civil investigation into his business practices, an intermediate...",
    "opening": "Article content\n\nFormer U.S. President Donald Trump must testify under oath in the New York Attorney General’s civil investigation into his business practices..."
  },
  {
    "title": "Mary Trump appeals ruling nixing suit against Donald Trump",
    "description": "NEW YORK (AP) — Mary Trump asked an appeals court on Wednesday to overturn a judge’s decision to reject her claims that her uncle Donald Trump and two of hi...",
    "opening": "This advertisement has not loaded yet, but your article continues below.\n\nCRA wins right to dig through big box store’s client lists for contractors evading t..."
  },
  {
    "title": "Donald Trump and the Kennedy Center controversy, explained",
    "description": "Canadian author Louise Penny has joined the growing list of people from the arts and culture communities to cancel events or dissociate themselves from the Kenn...",
    "opening": "Canadian author Louise Penny has joined the growing list of people from the arts and culture communities to cancel events or dissociate themselves from the Kenn..."
  },
  {
    "title": "Jeffrey Epstein and Donald Trump: a timeline",
    "description": "U.S. President Donald Trump keeps facing questions about Jeffrey Epstein, the multi-millionaire sex offender who died in jail in 2019 while facing federal charg...",
    "opening": "U.S. President Donald Trump keeps facing questions about Jeffrey Epstein, the multi-millionaire sex offender who died in jail in 2019 while facing federal charg..."
  },
  {
    "title": "Russell Brand: If it's a choice between Trump or Biden, only one candidate will protect democracy and freedom",
    "description": "In a clip obtained exclusively by Fox News Digital, Russell Brand weighed in on the upcoming presidential election during a discussion with RNC spokeswoman Eliz...",
    "opening": "EXCLUSIVE - Actor and comedian Russell Brand said he finds it difficult to understand why any freedom-loving American would choose to vote for President Biden o..."
  },
  {
    "title": "Comparing the Four Criminal Cases Against Donald Trump",
    "description": "An assessment of the four indictments against the former president, including notable features, strengths and weaknesses.",
    "opening": "An important part of the trial will be whether prosecutors can prove that Mr. Trump had the requisite criminal intent. But a common assertion — that if he tru..."
  },
  {
    "title": "How Donald Trump Shaped the 2024 G.O.P. Platform",
    "description": "From dictating exactly what he wanted party principles to say to confiscating delegates’ phones at the convention, the way Donald Trump went about getting his...",
    "opening": "new video loaded: How Donald Trump Shaped the 2024 G.O.P. Platform\n\nBy Shane Goldmacher, Nikolay Nikolov, Farah Otero-Amad, John Pappas, Laura Salaberry, Christ..."
  },
  {
    "title": "Ivana Trump, first wife of Donald Trump, dies at 73",
    "description": "WASHINGTON — Ivana Trump, the first wife of former U.S. President Donald Trump and the mother of his three oldest children, who helped her husband build some?...",
    "opening": "This advertisement has not loaded yet, but your article continues below.\n\nIvana Trump, first wife of Donald Trump, dies at 73\n\nArticle content WASHINGTON — Iv..."
  },
  {
    "title": "Trump must testify to NY AG Letitia James, judge rules; James responds",
    "description": "New York Attorney General Letitia James appeared to celebrate a court order that former President Donald Trump and two of his children must testify under oath i...",
    "opening": "NEW You can now listen to Fox News articles!\n\nNew York Attorney General Letitia James appeared to celebrate a court order that former President Donald Trump and..."
  },
  {
    "title": "Letters: Who's more reckless — Donald Trump or Justin Trudeahttps://nationalpost.com/wp-admin/edit.phpu?",
    "description": "Readers discuss Trump's fighting words on NATO, the blocking of a hospital by pro-Palestinian protesters, the 'Arrivescam' scandal, and more",
    "opening": "This advertisement has not loaded yet, but your article continues below.\n\nLetters: Who's more reckless — Donald Trump or Justin Trudeahttps://nationalpost.com..."
  },
  {
    "title": "Donald Trump has been indicted - what happens now?",
    "description": "NEW YORK — The events underlying Donald Trump’s indictment in New York – hush money payments to a porn star who claimed to have had a sexual encounter wit...",
    "opening": "This advertisement has not loaded yet, but your article continues below.\n\nOPP officer guilty of sexual assault on unconscious woman and recording it to 'teach h..."
  },
  {
    "title": "Fighter or optimist? Iowa Republicans eye Trump alternatives",
    "description": "CLIVE, Iowa (AP) — Many loyal Republicans in the state that kicks off the presidential nominating season are searching for a White House hopeful other than…",
    "opening": "This advertisement has not loaded yet, but your article continues below.\n\nWhy Sacha Trudeau won't have to testify about $200K donation from Chinese billionaire\n..."
  },
  {
    "title": "Donald Trump: 'I hate Taylor Swift!'",
    "description": "The U.S. presidential runner, 78, raged online on Sunday in an all-capitalized message.",
    "opening": "The U.S. presidential runner, 78, raged online on Sunday in an all-capitalized message\n\nThe U.S. presidential runner, 78, hit out at the ‘Shake it Off’ sing..."
  },
  {
    "title": "Trump offers Iran choice: Drop nuclear weapons or face 'maximum pressure'",
    "description": "Trump warns Iran to abandon nuclear ambitions or face",
    "opening": "President Donald Trump went after Iran in his first major speech in Saudi Arabia, warning that Tehran must choose between never having a nuclear weapon or deali..."
  },
  {
    "title": "Ivanka Trump and Donald Trump Jr. subpoenaed in asset probe",
    "description": "New York Attorney General Letitia James began the probe in 2019 to determine if Trump's company had been manipulating the value of key assets to take tax…",
    "opening": "This advertisement has not loaded yet, but your article continues below.\n\n\n\n\n\n\n\nShare this Story: Ivanka Trump and Donald Trump Jr. subpoenaed in asset probe\n\nI..."
  },
  {
    "title": "Morning Glory: Donald Trump supports Israel",
    "description": "Donald Trump gives a full-throated to defense of Israel at a time when Democrats are making it very hard for the Jewish state to defeat its enemies -- either in...",
    "opening": "NEW You can now listen to Fox News articles!\n\nFormer (and I think future) President Donald Trump is the best interview in the U.S. because unlike almost every o..."
  },
  {
    "title": "Trump called Catherine 'beautiful' — but was it a breach of royal protocol, or just cringey?",
    "description": "While observers weren't necessarily expecting a bow or curtsy, they may not have predicted a greeting this informal, either.",
    "opening": "While observers weren't necessarily expecting a bow or curtsy , they may not have predicted a greeting this informal, either.\n\nU.S. President Donald Trump's his..."
  },
  {
    "title": "Carson Jerema: The phoney Donald Trump annexation crisis",
    "description": "Latest musings about Canada becoming the 51st state are just more of the same trolling",
    "opening": "This advertisement has not loaded yet, but your article continues below.\n\nCarson Jerema: The phoney Donald Trump annexation crisis Latest musings about Canada b..."
  },
  {
    "title": "Trump says U.S. doesn't need Canada's oil, gas, vehicle or lumber imports",
    "description": "As Ottawa promises to retaliate against American trade tariffs, U.S. President Donald Trump has taken a new swipe at Canada.",
    "opening": "As Ottawa promises to retaliate against American trade tariffs, U.S. President Donald Trump has taken a new swipe at Canada.\n\nTrump says the United States does ..."
  },
  {
    "title": "Defence minister defends sovereignty after Trump promises Golden Dome access for $61B — or annexation",
    "description": "Defence Minister David McGuinty says Canada will control its defence spending, a day after U.S. President Donald Trump renewed his rhetoric to make the country ...",
    "opening": "Defence Minister David McGuinty says Canada will control its defence spending, a day after U.S. President Donald Trump renewed his rhetoric to make the country ..."
  },
  {
    "title": "Kellyanne Conway: Donald Trump is rising from the ashes. Here's why Trump 2016 is Trump 2024",
    "description": "Fox News contributor Kellyanne Conway dissects where things stand just days away from Election Day on Fox Nation’s ‘Here’s the Deal.’",
    "opening": "Here's the deal for this week, the very last and final push to Election Day. Ladies and gentlemen, it does feel like 2016 all over again, and for many different..."
  },
  {
    "title": "Voters report Kamala Harris is more radical than Trump: 'too liberal or progressive'",
    "description": "Voters reported in a new New York Times/Sienna College poll that Vice President Harris is viewed as \"too liberal\" more than former President Trump is considered...",
    "opening": "More voters report that Vice President Kamala Harris is \"too liberal or progressive\" on key policy issues than they considered former President Donald Trump as ..."
  },
  {
    "title": "Deciphering Donald Trump: How his rhetoric sends different messages",
    "description": "Some argue that it's not what President Trump says that's important, but what he does. I think understanding his rhetoric is crucial in deciphering his administ...",
    "opening": "Among the critics who posted on X Sunday after my Fox News show was one who made an argument that surprised me.\n\nDon’t pay attention to what President Trump s..."
  },
  {
    "title": "Trump, his children subpoenaed by New York attorney general in family business probe",
    "description": "New York's attorney general has issued subpoenas to former former U.S. president Donald Trump and his two eldest children in connection with an ongoing civil in...",
    "opening": "New York's attorney general has issued subpoenas to former former U.S. president Donald Trump and his two eldest children in connection with an ongoing civil in..."
  },
  {
    "title": "J.D. Tuccille: My Reluctant Vote for Donald Trump",
    "description": "An authoritarian narcissist could do less damage than a totalitarian control freak",
    "opening": "This advertisement has not loaded yet, but your article continues below.\n\nJ.D. Tuccille: My Reluctant Vote for Donald Trump Photo by Evan Vucci / THE ASSOCIATED..."
  },
  {
    "title": "Trump chief of staff pledges no 'drama' or second-guessing in White House",
    "description": "Incoming Trump White House chief of staff Susie Wiles pledged no tolerance for \"drama\" or \"backbiting\" in his second term during a rare interview published Mond...",
    "opening": "Incoming Trump White House chief of staff Susie Wiles said in an interview published Monday there would be no tolerance for \"drama\" or self-centered infighting ..."
  },
  {
    "title": "JESSE WATTERS: Donald Trump ripped the news cycle right out of Kamala's hands",
    "description": "Fox News host Jesse Watters gives his take on 'the moment that changed the campaign' on 'Jesse Watters Primetime.'",
    "opening": "Fox News host Jesse Watters says former President Trump won't \"tolerate disrespect\" after he had a contentious interview with several Black journalists at the N..."
  },
  {
    "title": "Kamala Harris 'hates Israel,' according to Donald Trump",
    "description": "The presidential candidates were asked how they would reach a ceasefire deal between Jerusalem and Hamas.",
    "opening": "This advertisement has not loaded yet, but your article continues below.\n\nKamala Harris 'hates Israel,' according to Donald Trump The presidential candidates we..."
  },
  {
    "title": "Donald Trump, Vladimir Lenin and Vladimir Leneen",
    "description": "The former president's riff about vote-counting takes on a sophisticated air.",
    "opening": "Listen 4 min Comment Gift Article Share\n\nThere’s an aphorism that Donald Trump has shared with the audience at political rallies in the past few years: What m..."
  },
  {
    "title": "A bullet — or bullet fragment — hit Trump during assassination attempt, FBI says",
    "description": "“What struck former President Trump in the ear was a bullet, whether whole or fragmented into smaller pieces, fired from the deceased subject’s rifle,” th...",
    "opening": "Former president Donald Trump was shot in the ear by a bullet or a bullet fragment during the assassination attempt at one of his campaign rallies, the FBI said..."
  },
  {
    "title": "Are you better off since Donald Trump took office?",
    "description": "DNC Chair Ken Martin declares that Democrats better represent working families as Trump faces criticism over golf trips, Epstein connections and rising prices",
    "opening": "NEW You can now listen to Fox News articles!\n\nTo paraphrase President Ronald Reagan, I think it’s time to ask: do you honestly feel better off today than you ..."
  },
  {
    "title": "Biden or Trump? During Washington visit, Alberta premier says, 'There's challenges with both'",
    "description": "Biden or Trump? During a visit to Washington, D.C., Alberta Premier Danielle Smith said:",
    "opening": "If the premier of Alberta has a preference in the upcoming U.S. presidential election, she's not sharing it publicly.\n\nAt a news conference during a trip to Was..."
  },
  {
    "title": "How Donald Trump Has Remade America’s Political Landscape",
    "description": "The steady march to the right across a vast number of counties reveals the extent of the nation's transformation in the Trump era, and the seriousness of the De...",
    "opening": "The Democrats’ problems run deep, nearly everywhere. This is where voters shifted toward President Trump in each of the last three elections. And this is wher..."
  },
  {
    "title": "Liberal comedian pummels piñata after learning Trump gaining with Latino voters",
    "description": "Actor and comedian John Leguizamo destroyed a piñata after learning former President Trump was gaining support among Latino voters as the election nears.",
    "opening": "Actor John Leguizamo attacked a piñata in a fit of rage Tuesday after learning Donald Trump was gaining support among Latino voters.\n\nAfter he mocked an ad fro..."
  },
  {
    "title": "Trump appeals New York’s US$454 million fraud verdict against him",
    "description": "Former U.S. president Donald Trump is alleged to have inflated the value of his assets by billions of dollars to get better terms on loans.",
    "opening": "Former U.S. president Donald Trump is alleged to have inflated the value of his assets by billions of dollars to get better terms on loans\n\nTrump had vowed to c..."
  },
  {
    "title": "Donald Trump indicted; 1st ex-president charged with crime",
    "description": "NEW YORK (AP) — A Manhattan grand jury has voted to indict Donald Trump on charges involving payments made during the 2016 presidential campaign to silence…",
    "opening": "This advertisement has not loaded yet, but your article continues below.\n\nLorne Gunter: Danielle Smith recording doesn't prove what CBC says it does\n\nRex Murphy..."
  },
  {
    "title": "LAURA INGRAHAM: They're trying to put Trump behind bars and or bankrupt him before the election",
    "description": "Fox News' Laura Ingraham says the left's longtime fantasy was to see NY AG Letitia James 'personally slap padlocks on the front doors of Trump's prized real est...",
    "opening": "Fox News host Laura Ingraham reacts to a New York appeals court slashing former President Trump's \"obscene\" New York civil fraud bond Monday on \"The Ingraham An..."
  },
  {
    "title": "Donald Trump arrives in Scotland for short golfing trip",
    "description": "ABERDEEN — Former U.S. President Donald Trump arrived in Scotland on Monday for a short trip to visit his golf courses in the country and in Ireland.",
    "opening": "Article content\n\nABERDEEN — Former U.S. President Donald Trump arrived in Scotland on Monday for a short trip to visit his golf courses in the country and in ..."
  },
  {
    "title": "MARK HALPERIN: The great debate: Is Donald Trump cool?",
    "description": "The topic: Is Donald J. Trump cool? And, relatedly, can he be considered, at last, a full-fledged, fully accepted, member of the American president’s clu...",
    "opening": "NEW You can now listen to Fox News articles!\n\n\"I could be sitting at the front row at an award show and I still don't feel like a cool kid.\"\n\n– A 22-year-old ..."
  },
  {
    "title": "Trump delivers ultimatum to Hamas: Accept deal and release hostages or pay the consequences",
    "description": "President Trump issues final warning to Hamas to release remaining hostages or face consequences as ceasefire negotiations continue to stall.",
    "opening": "NEW You can now listen to Fox News articles!\n\nPresident Donald Trump issued his \"last warning\" to Hamas to accept his deal and release the remaining hostages or..."
  },
  {
    "title": "Justice Dept. provides judge with redacted Trump affidavit",
    "description": "WASHINGTON (AP) — The Justice Department on Thursday submitted to a judge a redacted version of the affidavit it relied on when it federal agents searched the...",
    "opening": "FILE - Former President Donald Trump speaks at a rally Friday, Aug. 5, 2022, in Waukesha, Wis. The National Archives and Records Administration recovered 100 do..."
  },
  {
    "title": "Justice Dept. provides judge with redacted Trump affidavit",
    "description": "WASHINGTON (AP) — The Justice Department on Thursday submitted to a judge a redacted version of the affidavit it relied on when it federal agents searched the...",
    "opening": "FILE - Former President Donald Trump speaks at a rally Friday, Aug. 5, 2022, in Waukesha, Wis. The National Archives and Records Administration recovered 100 do..."
  },
  {
    "title": "Eric Trump to take the stand in non-jury civil trial against Trump Organization stemming from NYAG lawsuit",
    "description": "Eric Trump is expected to take the stand Thursday in the non-jury civil trial stemming from New York Attorney General Letitia James’ lawsuit against the Trump...",
    "opening": "Eric Trump is expected to take the stand Thursday in the non-jury civil trial stemming from New York Attorney General Letitia James’ lawsuit against the Trump..."
  },
  {
    "title": "U.S. charges New York man with threatening to kill Donald Trump",
    "description": "NEW YORK — A New York man has been criminally charged with threatening to kill former U.S. President Donald Trump, court papers show.",
    "opening": "U.S. charges New York man with threatening to kill Donald Trump\n\nArticle content\n\nNEW YORK — A New York man has been criminally charged with threatening to ki..."
  },
  {
    "title": "Tamara Keith and Amy Walter on whether Newsom’s tactics against Trump are working",
    "description": "NPR’s Tamara Keith and Amy Walter of the Cook Political Report with Amy Walter join Amna Nawaz to discuss the latest political news, including Democrats trail...",
    "opening": "Amy Walter, The Cook Political Report:\n\nRight.\n\nWell, it's working in his home state. In fact, there was a poll out just the other week that showed that Governo..."
  },
  {
    "title": "Civil rape case against Donald Trump begins in Manhattan court",
    "description": "E. Jean Carroll's accusation that Donald Trump raped her was not a",
    "opening": "E. Jean Carroll's accusation that Donald Trump raped her was not a \"he said, she said\" dispute, a lawyer representing the writer said as a civil trial over the ..."
  },
  {
    "title": "Is Pierre Poilievre too 'in sync' with Donald Trump?",
    "description": "The most controversial statement of the federal election so far was uttered before the campaign even started — and not by a federal politician, but the premie...",
    "opening": "The most controversial statement of the federal election so far was uttered before the campaign even started — not by a federal politician, but the premier of..."
  },
  {
    "title": "Joe Rogan endorses Donald Trump before voters hit the polls",
    "description": "Trump is scheduled to hold a campaign watch party in Palm Beach, while Harris plans to attend a party at Howard University in Washington.",
    "opening": "'(Musk) makes what I think is the most compelling case for Trump you'll hear, and I agree with him every step of the way,' Rogan said on X\n\nArticle content\n\nAme..."
  },
  {
    "title": "Trump family complaint alleges NY AG Letitia James broke state laws in politically motivated investigation",
    "description": "A new court filing from the Trump family accuses New York Attorney General Letitia James of abandoning legal principals in an attempt to gain political support ...",
    "opening": "NEW You can now listen to Fox News articles!\n\nA new court filing from the Trump family accuses New York Attorney General Letitia James of abandoning legal princ..."
  },
  {
    "title": "New York attorney general calls for new sanctions against Donald Trump",
    "description": "NEW YORK — New York’s attorney general on Tuesday asked a judge to sanction former U.S. President Donald Trump, his adult children, the Trump Organization a...",
    "opening": "This advertisement has not loaded yet, but your article continues below.\n\nCanadian plan to confiscate Russian assets could upend global economy, says Moscow thi..."
  },
  {
    "title": "This is how Donald Trump can terminate tariff turmoil",
    "description": "President Donald Trump and Secretary Scott Bessent still have economic runway to get things done and alleviate all the tariff turmoil in the coming weeks and mo...",
    "opening": "NEW You can now listen to Fox News articles!\n\nThis past April has been one of the most volatile months in stock market history, thanks to the Trump administrati..."
  },
  {
    "title": "Is it illegal for Donald Trump to buy a Glock handgun? | About That",
    "description": "During a campaign stop at a gun shop, former U.S president Donald Trump said he wanted to buy a handgun with his face on it. Andrew Chang explains why buying, o...",
    "opening": "Is it illegal for Donald Trump to buy a Glock handgun? | About That\n\nNews\n\nDuration 5:23\n\nDuring a campaign stop at a gun shop, former U.S president Donald Trum..."
  },
  {
    "title": "Donald Trump set to speak from Florida after arraignment",
    "description": "WASHINGTON — Former U.S. President Donald Trump will speak in Florida on Tuesday evening, his office said, after his arraignment in New York City on historic?...",
    "opening": "This advertisement has not loaded yet, but your article continues below.\n\nEight police officers were killed in just seven months. Canadians are searching for an..."
  },
  {
    "title": "Donald Trump will try to turn conviction into campaign fuel",
    "description": "Trump's lawyers and allies described him as defiant and ready to fight a verdict they argue is illegitimate and driven by politics",
    "opening": "This advertisement has not loaded yet, but your article continues below.\n\nDonald Trump will try to turn conviction into campaign fuel Trump's lawyers and allies..."
  },
  {
    "title": "Events leading up to Donald Trump sexual abuse verdict",
    "description": "Here is a timeline of writer E. Jean Carroll’s lawsuit against Donald Trump that culminated on Tuesday with jurors finding that he sexually abused and defamed...",
    "opening": "This advertisement has not loaded yet, but your article continues below.\n\nTasha Kheiriddin: Laughable for Liberals to say they 'won't tolerate' Chinese interfer..."
  },
  {
    "title": "For Christie, New Hampshire’s Primary Is Do or Die",
    "description": "An upset victory over Donald Trump in New Hampshire could be a knockout blow, according to Chris Christie. He is staking his presidential campaign on winning th...",
    "opening": "We’re here in New Hampshire, outside a brewery with Gov. Chris Christie because, as he told us, this is his make-or-break state. His path to the Republican no..."
  },
  {
    "title": "New York, in lawsuit, says Trump inflated net worth by billions",
    "description": "Lawsuit says trump and the trump",
    "opening": "New York, in lawsuit, says Trump inflated net worth by billions\n\norganization used false and misleading statements ‘repeatedly\n\nNew York, in lawsuit, says Tru..."
  },
  {
    "title": "New York defense attorney argues legal system was weaponized against Trump",
    "description": "New York defense attorney Arthur Aidala told a CNN panel Thursday night that \"the DOJ was weaponized against Donald Trump\" and it was \"definitely targeting him....",
    "opening": "New York defense attorney and political commentator Arthur Aidala said that President Donald Trump faced a clear \"weaponization\" of the legal system against him..."
  },
  {
    "title": "FBI agents sue over Justice Dept. effort to ID employees involved in Trump-related investigations",
    "description": "FBI agents who participated in investigations related to President Donald Trump have sued over Justice Department efforts to develop a list of employees involve...",
    "opening": "WASHINGTON (AP) — FBI agents who participated in investigations related to President Donald Trump have sued over Justice Department efforts to develop a list ..."
  },
  {
    "title": "Donald Trump nominates Linda McMahon for U.S. education secretary",
    "description": "U.S. president-elect Donald Trump has chosen Linda McMahon as education secretary, putting the former pro-wrestling mogul at the helm of a department Trump has ...",
    "opening": "U.S. president-elect Donald Trump has chosen Linda McMahon as education secretary, putting the former pro-wrestling mogul at the helm of a department Trump has ..."
  },
  {
    "title": "Trump allies file ethics complaint against Gov. DeSantis",
    "description": "TALLAHASSEE, Fla. (AP) — Allies of former President Donald Trump  have filed a complaint with the Florida Commission on Ethics  accusing Gov.",
    "opening": "FILE - President Donald Trump talks to Florida Gov. Ron DeSantis, left, during a visit to Lake Okeechobee and Herbert Hoover Dike at Canal Point, Fla., March 29..."
  },
  {
    "title": "Ron DeSantis’s problem is not that Donald Trump is famous",
    "description": "This cope-centered argument was also not the problem for Trump’s opponents in 2016.",
    "opening": "Listen 6 min Share Comment Add to your saved stories Save\n\nBack in August, the guy running a super PAC backing Florida Gov. Ron DeSantis’s bid for the 2024 Re..."
  },
  {
    "title": "New Yorkers weigh in on whether they could be impartial jurors in Trump trial",
    "description": "Jury selection is slated to start Monday in the long awaited hush money trail. We asked New Yorkers how they’d fare being on the jury. Could they be impartial...",
    "opening": "When Donald Trump walks into a Manhattan courtroom on Monday, it will kick off a process unprecedented in American history: jury selection for a former presiden..."
  },
  {
    "title": "'Hannity' interviews former President Donald Trump",
    "description": "'Hannity' welcomed the 45th president of the United States, Donald J. Trump",
    "opening": "This is a rush transcript of \"Hannity\" on January 20, 2022. This copy may not be in its final form and may be updated.\n\nSEAN HANNITY, FOX NEWS HOST: All right. ..."
  },
  {
    "title": "Joe Concha details the value of a Trump endorsement",
    "description": "Fox News contributor Joe Concha told Sean Hannity how lucky a candidate is to receive an endorsement from Donald Trump.",
    "opening": "NEW You can now listen to Fox News articles!\n\nFox News contributor Joe Concha told Sean Hannity how it benefits a candidate to receive an endorsement from Donal..."
  },
  {
    "title": "Donald Trump to surrender to history-making criminal charges",
    "description": "NEW YORK (AP) — An extraordinary moment in U.S. history is scheduled to unfold in a Manhattan courthouse Tuesday: Former President Donald Trump, who faces…",
    "opening": "This advertisement has not loaded yet, but your article continues below.\n\nCanadian troops in Poland not being reimbursed for meals, putting financial burden on ..."
  },
  {
    "title": "The New York hush-money probe of Donald Trump explained",
    "description": "NEW YORK (AP) — In the final weeks of the 2016 presidential election, Donald Trump’s lawyer tried to buy the silence of a porn actress who said she had a…",
    "opening": "This advertisement has not loaded yet, but your article continues below.\n\nThese COVID-19 restrictions still remain three years after pandemic declared\n\nChinese ..."
  },
  {
    "title": "Donald Trump, the attention economy's most potent stimulus",
    "description": "In the currency of today’s attention economy, Donald Trump is the world’s richest man.",
    "opening": "This advertisement has not loaded yet, but your article continues below.\n\nTasha Kheiriddin: Steven Guilbeault has no plan for those left behind by green 'innova..."
  },
  {
    "title": "JASON CHAFFETZ: How did Trump do it?",
    "description": "Former President Donald Trump ran on strength and making America great again. The traditional legacy media never understood the power of that vision.",
    "opening": "NEW You can now listen to Fox News articles!\n\nIn the biggest political comeback in our lifetime, Donald Trump will once again be seated in the Oval Office as th..."
  },
  {
    "title": "The New York hush-money probe of Donald Trump explained",
    "description": "NEW YORK (AP) — In the final weeks of the 2016 presidential election, Donald Trump’s lawyer tried to buy the silence of a porn actress who said she had a se...",
    "opening": "FILE - Former President Donald Trump pumps his fist after speaking at the Conservative Political Action Conference, March 4, 2023, Oxon Hill, Md. The Manhattan ..."
  },
  {
    "title": "Michael Higgins: Democrats weaponize justice system against Donald Trump",
    "description": "Every New York state judge who would hear the case has been elected on a partisan level",
    "opening": "This advertisement has not loaded yet, but your article continues below.\n\nJennifer Aniston says kids will find Friends offensive cause they are too woke\n\nFormer..."
  },
  {
    "title": "Trump, Ivanka, Don Jr subpoenaed by NY attorney general",
    "description": "NEW YORK (AP) — New York Attorney General Letitia James recently subpoenaed former President Donald Trump and his two eldest children, demanding their testimo...",
    "opening": "FILE - Former President Donald Trump speaks during his Save America rally in Perry, Ga., Sept. 25, 2021. A resurgent GOP is poised to reclaim one, if not both, ..."
  },
  {
    "title": "Donald Trump is reinstated to Facebook after 2-year ban",
    "description": "Facebook parent Meta is reinstating former President Donald Trump's personal account after a two-year suspension  following the Jan.",
    "opening": "President Donald Trump gestures as he arrives to speak at a rally on Jan. 6, 2021, in Washington. Facebook parent Meta is reinstating former President Donald Tr..."
  },
  {
    "title": "Fiancee of Donald Trump Jr hit by Jan. 6 committee subpoena",
    "description": "WASHINGTON — The congressional committee",
    "opening": "Article content\n\nWASHINGTON — The congressional committee\n\nWe apologize, but this video has failed to load.\n\ntap here to see other videos from our team. Try r..."
  },
  {
    "title": "Donald Trump insults Detroit while campaigning in Detroit",
    "description": "",
    "opening": "This advertisement has not loaded yet, but your article continues below.\n\nDonald Trump insults Detroit while campaigning in Detroit 'Our whole country will end ..."
  },
  {
    "title": "A few short minutes after Trump took the stage, shots rang out",
    "description": "A few short minutes into Donald Trump's campaign rally, shots rang out, at least five. He clutched at his ear as dark-suited Secret Service agents dashed toward...",
    "opening": "BUTLER, Pa. (AP) — At 6:02 pm Saturday, to the strains of “God Bless the U.S.A.,” former President Donald Trump took the stage at fairgrounds in Butler, P..."
  },
  {
    "title": "Trump orders nuclear submarines moved to positions near Russia",
    "description": "U.S. President Donald Trump on Friday said he had ordered two nuclear submarines to be positioned in regions near Russia in response to threats from former ...",
    "opening": "U.S. President Donald Trump on Friday said he had ordered two nuclear submarines to be positioned in regions near Russia in response to threats from former Russ..."
  },
  {
    "title": "Yankees legend Mariano Rivera endorses Donald Trump for president",
    "description": "New York Yankees legend Mariano Rivera endorsed former President Trump for president with about seven months to go before the 2024 presidential election.",
    "opening": "New York Yankees legend Mariano Rivera expressed his belief that former President Trump could knock it out of the park if he is elected as president in November..."
  },
  {
    "title": "Could Donald Trump be a boon for Canadian patriotism?",
    "description": "The return of Donald Trump — and his jokes about the 51st state — will likely provide new opportunities for Canada to decide how much and how loudly it wan...",
    "opening": "In January 2017, Donald Trump signed an executive order that banned immigration to the United States from seven Muslim-majority countries . Amid the turmoil tha..."
  },
  {
    "title": "New York attorney general calls for new sanctions against Donald Trump",
    "description": "NEW YORK — New York’s attorney general on Tuesday asked a judge to sanction former U.S. President Donald Trump, his adult children, the Trump Organization a...",
    "opening": "This advertisement has not loaded yet, but your article continues below.\n\nCanadian plan to confiscate Russian assets could upend global economy, says Moscow thi..."
  },
  {
    "title": "Morning Glory: Can Donald Trump restore deterrence?",
    "description": "Since President Biden took office the Taliban took over Afghanistan, Putin invaded Ukraine, Hamas invaded Israel, Iran’s proxies have attacked Americans, and ...",
    "opening": "Join Fox News for access to this content Plus special access to select articles and other premium content with your account - free of charge. Please enter a val..."
  },
  {
    "title": "CNN data guru says Donald Trump 'very much in this ball game' despite Harris' polling gains",
    "description": "CNN's Harry Enten warned that Donald Trump was historically underestimated in election polling and was",
    "opening": "CNN's Harry Enten warned on Tuesday that historically Donald Trump has been underestimated in the polls, despite surveys showing Vice President Harris gaining m..."
  },
  {
    "title": "Graham criticizes McConnell over debt ceiling, says GOP leaders must work with Trump",
    "description": "\"Donald Trump is the most consequential Republican in the entire Republican Party,\" Sen. Lindsey Graham (R-S.C.) said on \"Fox News Sunday.\"",
    "opening": "“We’re going into an election cycle where the wind’s to our back. We can’t do this again,” Graham told Wallace. “But when you look forward to this p..."
  },
  {
    "title": "Jamil Jivani: Should we care that Twitter banned Donald Trump?",
    "description": "A new batch of Twitter Files focuses on the company's decision to ban the president of the United States from its platform",
    "opening": "A new batch of Twitter Files focuses on the company's decision to ban the president of the United States from its platform\n\nArticle content\n\nMuch of the news co..."
  },
  {
    "title": "Majority of veterans polled support re-election of Donald Trump: 'We want Trump back'",
    "description": "Veterans 4 America First Institute's Darin Selnick responded to a recent Pew Research poll showing former President Donald Trump garnering a majority of veteran...",
    "opening": "A recent Pew Research Poll gives former President Donald Trump the lead with veterans nationwide over Vice President Kamala Harris ahead of Tuesday's presidenti..."
  },
  {
    "title": "Donald Trump wins ruling in rape accuser Carroll's defamation lawsuit",
    "description": "NEW YORK — A federal appeals court set aside a judge’s ruling that Donald Trump could be sued for defamation by E. Jean Carroll after denying he raped her,?...",
    "opening": "This advertisement has not loaded yet, but your article continues below.\n\nDonald Trump wins ruling in rape accuser Carroll's defamation lawsuit\n\nArticle content..."
  },
  {
    "title": "Anti-Trump commentator admits Biden's pardon of Hunter is 'just deflating'",
    "description": "Former Congressman Joe Walsh, a Trump critic, criticized President Biden's decision to pardon his son Hunter Biden despite promising that he would not do so.",
    "opening": "Former Congressman Joe Walsh, a frequent critic of President-elect Donald Trump, appeared on MSNBC Sunday night to criticize President Biden's decision to pardo..."
  },
  {
    "title": "First lady 'a bit of My Fair Lady' — or Carmen Sandiago? — in head-turning Trump inauguration outfit",
    "description": "Adam Lippes designed the ensemble, while the matching hat was from fellow American designer Eric Javits.",
    "opening": "Adam Lippes designed the ensemble, while the matching hat was from fellow American designer Eric Javits\n\nMelania Trump, the wife of incoming U.S. President Dona..."
  },
  {
    "title": "The Trump Trials: Cannon Fodder",
    "description": "Tracking the criminal -- and civil -- trials of former president Donald Trump, in D.C., Florida, Georgia and New York.",
    "opening": "More on the Trump Jan. 6 indictment\n\nThe charges: Former president Donald Trump pleaded not guilty to charges that he plotted to overturn the 2020 election in t..."
  },
  {
    "title": "Former Michael Cohen adviser: 'He told me he had nothing on Trump,' Stormy NDA was 'his idea'",
    "description": "Robert Costello, a former legal adviser to Michael Cohen, told America's Newsroom that he believes he should be called to testify.",
    "opening": "Robert Costello, a former legal adviser to Michael Cohen, told America's Newsroom that he believes he should be called to testify, that the Trump trial grand ju..."
  },
  {
    "title": "Ex-NFL star RG III pinpoints 'moment Trump won the election'",
    "description": "Robert Griffin III posted the famed photo of Trump after Trump survived an assassination attempt, pointing to that as the moment Trump won the presidency.",
    "opening": "Former NFL star and sports media personality Robert Griffin III gave his take on Tuesday's presidential election in a post on X Wednesday.\n\nThe ex-quarterback p..."
  },
  {
    "title": "Donald Trump could be charged any day - what happens next?",
    "description": "NEW YORK — Donald Trump could be charged in New York as soon as this week for allegedly covering up hush money payments to a porn star during his 2016…",
    "opening": "This advertisement has not loaded yet, but your article continues below.\n\n'I'm sure China didn't mean anything by it': Inside the thoughts of David Johnston\n\nJe..."
  },
  {
    "title": "SEAN HANNITY: Trump prosecutor Fani Willis threw 'lover' Nathan Wade 'under the bus'",
    "description": "Fox News host Sean Hannity criticized Superior Court Judge Scott McAfee's ruling in the case to remove DA Fani Willis from the Georgia-Trump case",
    "opening": "Fox News host Sean Hannity reacts to a ruling in the case to remove Fulton County District Attorney Fani Willis from the Georgia election interference case agai..."
  },
  {
    "title": "Sportscaster Bob Costas lambasts media's dealings with Trump",
    "description": "Legendary sportscaster Bob Costas ripped the coverage of President Donald Trump in a diatribe speech at Syracuse University on Monday night.",
    "opening": "NEW You can now listen to Fox News articles!\n\nLegendary sportscaster Bob Costas slammed several media organizations for how they have dealt with President Donal..."
  },
  {
    "title": "Mike Pence, other former top Trump officials featured in Harris campaign ad slamming Trump as 'dangerous'",
    "description": "Former top Trump administration officials are being featured in a new ad from the Harris campaign, including Trump's former running mate Mike Pence and his form...",
    "opening": "A new ad from the Harris campaign slamming Trump as \"dangerous\" will feature comments from several former top Trump officials, including former Vice President M..."
  },
  {
    "title": "‘The Apprentice’ and the creation of Leader Donald Trump",
    "description": "In 2024, Donald Trump no longer relies on his TV celebrity — and has warped reality so that he is no longer an exception.",
    "opening": "Bill Pruitt’s description of his time producing the NBC show “The Apprentice” reads like a confessional. Newly released from his nondisclosure agreement, ..."
  },
  {
    "title": "SEAN HANNITY: Donald Trump hasn't gotten a fair trial in New York",
    "description": "Fox News host Sean Hannity says former President Donald Trump cannot get a fair trial in New York as court resumes for the lawsuit on \"Hannity.\"",
    "opening": "Fox News host Sean Hannity shreds the weaponization of justice against President Trump on \" Hannity .\"\n\nSEAN HANNITY: I said from day one, Donald Trump can't ge..."
  },
  {
    "title": "Are Trump supporters of color racist or misogynists? Black Trump voters in Detroit react",
    "description": "Black supporters of President-elect Donald Trump reacted to the notion that Americans who voted for the incoming GOP presidential candidate are racist and misog...",
    "opening": "Black supporters of President-elect Donald Trump in Michigan slammed the notion that Black and Hispanic American men who voted for the incoming commander-in-chi..."
  },
  {
    "title": "Billionaire who helped Trump with $175M bond says he 'probably didn't charge enough'",
    "description": "Billionaire Don Hankey, the businessman who helped facilitate former President Donald Trump's $175 million bond, says he perhaps should have charged more due to...",
    "opening": "The billionaire business mogul who provided former President Donald Trump with the massive bond required to appeal his case in New York says he might not have c..."
  },
  {
    "title": "Trump escapes prison, fines in felony hush-money case",
    "description": "U.S. president-elect Donald Trump has escaped any penalty other than a criminal record for his felony crimes after a judge on Friday handed him an alternative s...",
    "opening": "U.S. president-elect Donald Trump has escaped any legal punishment other than a criminal record for his felony crimes, after a judge on Friday handed him an alt..."
  },
  {
    "title": "Musk says he would reverse Twitter ban on Donald Trump",
    "description": "Tesla Chief Executive Elon Musk said Tuesday he would reverse Twitter’s ban on former U.S. President Donald Trump, while speaking at the Financial Times Futur...",
    "opening": "Article content\n\nTesla Chief Executive Elon Musk said Tuesday he would reverse Twitter’s ban on former U.S. President Donald Trump, while speaking at the Fina..."
  },
  {
    "title": "Biden's bully: The real reason Robert De Niro spoke out before the Trump verdict",
    "description": "Was De Niro’s rant – in which he told us that a Trump presidency will mean elections are 'all done' and that he will 'destroy' not only NYC, but the world r...",
    "opening": "NEW You can now listen to Fox News articles!\n\nWhat a spectacle. As the Donald Trump defense team summed up its case in downtown Manhattan, the Biden administrat..."
  },
  {
    "title": "Appeals court lets Trump administration suspend or end billions in foreign aid funding",
    "description": "Two of three judges from the U.S. Court of Appeals for the District of Columbia Circuit concluded that grant recipients challenging the freeze did not meet the ...",
    "opening": "In January, on the first day of his second term in the White House, Republican President Donald Trump issued an executive order directing the State Department a..."
  },
  {
    "title": "‘Long live Donald Trump’: Indians express their support after shooting",
    "description": "For many leaders and supporters of India’s ruling BJP, the struggles of Donald Trump mirror their own battles against the opposition.",
    "opening": "NEW DELHI — For the next seven days, men in saffron robes will crowd into a small room in the Indian capital to chant a protective mantra over 100,000 times t..."
  },
  {
    "title": "Derek H. Burney: Democrats gain from disruptive Donald Trump",
    "description": "Being the consummate narcissist, Trump shoulders none of the blame and his prospects for running again loom large",
    "opening": "This advertisement has not loaded yet, but your article continues below.\n\nJohn Ivison: Why Jean-Yves Duclos is not happy with provincial health ministers\n\nRaymo..."
  },
  {
    "title": "Melania Trump not on speaker list for GOP convention",
    "description": "The former first lady is expected to attend the convention, but she has largely abstained from participating in political events since leaving the White House.",
    "opening": "Former first lady Melania Trump is not on the list of headliners and keynote speakers announced Saturday for the Republican National Convention. She is, however..."
  },
  {
    "title": "Trump hush money trial: Why Americans can't see or hear what's going inside court",
    "description": "For the first time, a former U.S. president is facing criminal charges in an American courtroom. Yet, the nation had to rely on secondhand accounts of what was ...",
    "opening": "NEW YORK (AP) — It’s a moment in history — the first U.S. president facing criminal charges in an American courtroom. Yet only a handful of observers are ..."
  },
  {
    "title": "UFC fans share what they think about Trump ahead of O'Malley-Dvalishvili showdown",
    "description": "Fans at the UFC match between Merab Dvalishvili and Sean O'Malley in Newark discussed President Trump's second term performance while ahead of his arrival at th...",
    "opening": "NEW You can now listen to Fox News articles!\n\nUFC fans gathered in Newark, N.J., for the highly anticipated matchup between Merab Dvalishvili and Sean O'Malley...."
  },
  {
    "title": "Ivana Trump, first wife of Donald Trump who helped build his empire, dies at 73",
    "description": "Ivana Trump, the first wife of former U.S. President Donald Trump and the mother of his three oldest children, who helped her husband build some of his…",
    "opening": "This advertisement has not loaded yet, but your article continues below.\n\nIvana Trump, first wife of Donald Trump who helped build his empire, dies at 73\n\nArtic..."
  },
  {
    "title": "Nikki Haley, Donald Trump and the New Hampshire wild card",
    "description": "The New Hampshire primary will be held on Tuesday, January 23. Now that Florida's Ron DeSantis has dropped out, it's a race between Nikki Haley and Donald Trump...",
    "opening": "Join Fox News for access to this content Plus get unlimited access to thousands of articles, videos and more with your free account! Please enter a valid email ..."
  },
  {
    "title": "Donald Trump wins crucial swing state of North Carolina",
    "description": "A divided America makes its decision in a stark choice for the nation's future Tuesday",
    "opening": "This advertisement has not loaded yet, but your article continues below.\n\nDonald Trump wins crucial swing state of North Carolina A divided America makes its de..."
  },
  {
    "title": "Sarah Huckabee Sanders endorses Trump, says Americans will reject Biden's 'posture of weakness'",
    "description": "Arkansas Gov. Sarah Huckabee Sanders said on",
    "opening": "Arkansas Gov. Sarah Huckabee Sanders joined \"FOX & Friends\" Monday to discuss her decision to endorse former President Trump in the 2024 Republican race. The fo..."
  },
  {
    "title": "Why this is the indictment that could harm Donald Trump",
    "description": "Donald Trump said late Thursday he'd been indicted on charges of mishandling classified documents, touching off what could be the worst of a number of legal thr...",
    "opening": "This is the big one. The gravest legal threat Donald Trump has ever faced, the one most likely to rattle his political comeback and imperil his very freedom.\n\nT..."
  },
  {
    "title": "Manhattan DA suggests one-month delay to Donald Trump hush money trial",
    "description": "Prosecutors suggested a one-month delay in the upcoming hush money trial of Donald Trump.",
    "opening": "Trump New York hush money case\n\nThe latest: Former president Donald Trump’s criminal hush money trial in New York is scheduled for March 2024, making it the f..."
  },
  {
    "title": "J.D. Tuccille: Donald Trump and the curse of high expectations",
    "description": "The president set himself up for a big win or a painful fall",
    "opening": "This advertisement has not loaded yet, but your article continues below.\n\nJ.D. Tuccille: Donald Trump and the curse of high expectations The president set himse..."
  },
  {
    "title": "WATCH: Trump says U.S. takes refugees of ‘persecution or genocide,’ including Afrikaners",
    "description": "He also repeated false claims that millions of refugees are entering the U.S. from other countries \"totally unvetted.\"",
    "opening": "When pressed about fast-tracking white South Africans into the U.S. as refugees, President Donald Trump said Wednesday that the U.S. takes refugees from “many..."
  },
  {
    "title": "Donald Trump isn't first ex-president to face legal trouble",
    "description": "NEW YORK (AP) — Donald Trump has made history so many times.",
    "opening": "This advertisement has not loaded yet, but your article continues below.\n\n'The Oscar you received was given by mistake': Toronto filmmaker Sarah Polley pranked ..."
  },
  {
    "title": "Judge keeps tying Trump to possible intimidation",
    "description": "Juan Merchan has cited at least three instances of Trump’s potentially intimidating a witness or jurors. But experts say it’s hard to police.",
    "opening": "Donald Trump seems to face an increasing threat of jail during his Manhattan criminal trial. It’s not just that he’s violated his gag order 10 times. New Yo..."
  },
  {
    "title": "Trump launches precision strikes against Iran. Triumph or trap?",
    "description": "Iran now faces a choice: capitulate or retaliate. The odds overwhelmingly favor retaliation. The U.S. and its allies must now pivot quickly to containment, dete...",
    "opening": "NEW You can now listen to Fox News articles!\n\nUntil Saturday night, the world waited to see whether President Donald Trump would join Israel’s campaign agains..."
  },
  {
    "title": "Trump arrives for testimony in New York investigation",
    "description": "Former President Donald Trump will be questioned under oath Wednesday in the New York attorney general’s long-running civil investigation. Follow AP's live co...",
    "opening": "Former President Donald Trump gestures as he departs Trump Tower, Wednesday, Aug. 10, 2022, in New York, on his way to the New York attorney general's office fo..."
  },
  {
    "title": "Donald Trump threatens to double tariffs on Canadian steel and aluminum",
    "description": "Trump says 50 per cent tariffs will be placed on Canadian steel and aluminum on Wednesday.",
    "opening": "This advertisement has not loaded yet, but your article continues below.\n\nDonald Trump threatens to double tariffs on Canadian steel and aluminum Trump says 50 ..."
  },
  {
    "title": "Trump says he'll surrender to Georgia officials Thursday",
    "description": "Former U.S. president Donald Trump plans to turn himself in and be processed in Atlanta on Thursday in connection with his indictment in Georgia, he said on soc...",
    "opening": "Former U.S. president Donald Trump plans to turn himself in and be processed in Atlanta on Thursday in connection with his indictment in Georgia, he said on soc..."
  },
  {
    "title": "Claire Lehman: Donald Trump, American folk hero",
    "description": "Attempted assassination gave former president an opportunity to display the very qualities that made him a cult icon",
    "opening": "This advertisement has not loaded yet, but your article continues below.\n\nClaire Lehman: Donald Trump, American folk hero Attempted assassination gave former pr..."
  },
  {
    "title": "ABC News settles defamation lawsuit with Donald Trump for $15 million",
    "description": "ABC News will pay $15 million settle a defamation lawsuit filed by Donald Trump following false claims by anchor George Stephanopoulos.",
    "opening": "Outlet will make a contribution to a 'Presidential foundation and museum to be established by or for Plaintiff' and pay $1 million in the U.S. President-elect's..."
  },
  {
    "title": "Incoherence defines Trump foreign policy - The Washington Post",
    "description": "Many MAGA loyalists don’t bat an eye as Trump mediates conflicts while also saber-rattling.",
    "opening": "Is President Donald Trump a peacemaker or a warmonger? An interventionist or an isolationist? The answer is: yes. He contains multitudes, and it’s nearly impo..."
  },
  {
    "title": "Donald Trump describes assassination attempt in speech at Republican convention",
    "description": "Republican presidential candidate Donald Trump on Thursday dramatically recounted his brush with death in his speech at the convention",
    "opening": "This advertisement has not loaded yet, but your article continues below.\n\nDonald Trump describes assassination attempt in speech at Republican convention 'So ma..."
  },
  {
    "title": "NY attorney general seeks to have Donald Trump held in contempt of court",
    "description": "NEW YORK — New York’s attorney general on Thursday asked a state judge to hold Donald Trump in contempt of court for not turning over documents she subpoena...",
    "opening": "Article content\n\nNEW YORK — New York’s attorney general on Thursday asked a state judge to hold Donald Trump in contempt of court for not turning over docum..."
  },
  {
    "title": "American allies worry the US is growing less dependable, whether Trump or Biden wins",
    "description": "As chances rise of a Joe Biden-Donald Trump rematch in the U.S. presidential election race, America’s allies are bracing for a bumpy ride.",
    "opening": "LONDON (AP) — As chances rise of a Joe Biden-Donald Trump rematch in the U.S. presidential election race, America’s allies are bracing for a bumpy ride.\n\nMa..."
  },
  {
    "title": "One poll question summarizes eight years of Donald Trump",
    "description": "Asked who they trust for information about Ukraine, Republicans were most likely to point to the former president.",
    "opening": "One presentation of the rise of Donald Trump focuses on the anti-establishment backlash that the Republican Party experienced during the presidency of Barack Ob..."
  },
  {
    "title": "SEAN HANNITY: The days of anti-Trump, anti-conservative witch hunts are over",
    "description": "Fox News host Sean Hannity says the charges against President-elect Donald Trump were 'never about justice' on 'Hannity.'",
    "opening": "Fox News host Sean Hannity breaks down Judge Tanya Chutkan granting Special Counsel Jack Smith's motion to dismiss the Jan. 6 election subversion case against P..."
  },
  {
    "title": "Trump challenges Biden to golf match, says he'll give $1 million to charity if he loses",
    "description": "After sparring over their respective golf handicaps in their debate in Atlanta back in June, former president Donald Trump has challenged President Biden to a m...",
    "opening": "After the two presidential candidates got into a heated discussion about their golf handicaps, former president Donald Trump now wants to walk the walk.\n\nAt his..."
  },
  {
    "title": "Trump says FBI agents raided his Florida home",
    "description": "Former U.S. President Donald Trump said on Monday his home in Palm Beach, Florida, has been raided by FBI agents.",
    "opening": "Article content\n\nFormer U.S. President Donald Trump said on Monday his home in Palm Beach, Florida, has been raided by FBI agents.\n\nWe apologize, but this video..."
  },
  {
    "title": "Trump sexual assault allegations could be aired in court next week in civil trial",
    "description": "Donald Trump is already the first former U.S. president to face criminal charges. Jurors are expected to soon decide in an unrelated civil case whether he lied ...",
    "opening": "Two people have gone public to corroborate E. Jean Carroll's claim that she was raped by Donald Trump in mid-90s. Trump has denied sexually assaulting anyone, i..."
  },
  {
    "title": "Jurors set to deliberate in civil rape case against Donald Trump",
    "description": "NEW YORK — Jurors on Tuesday will begin deliberating whether Donald Trump raped writer E. Jean Carroll more than two decades ago and then defamed her by…",
    "opening": "This advertisement has not loaded yet, but your article continues below.\n\nHearing begins for alleged top Toronto mobster Canada has tried to send to Italy for 4..."
  },
  {
    "title": "Donald Trump says he never read book accusing him of rape",
    "description": "NEW YORK (AP) — Former President Donald Trump said he has never read any part of a book in which the columnist E. Jean Carroll accused him of raping her in a?...",
    "opening": "This advertisement has not loaded yet, but your article continues below.\n\nMichael Shellenberger: Davos is a grift and a cult but it’s also a bid for global do..."
  },
  {
    "title": "Rape lawsuit trial against Donald Trump set to get underway",
    "description": "Jurors are about to be chosen to hear former advice columnist E. Jean Carroll's claims that Donald Trump raped her in the dressing room of a luxury Manhattan de...",
    "opening": "FILE - Former President Donald Trump speaks at the National Rifle Association Convention in Indianapolis, Friday, April 14, 2023. ury selection starts Tuesday i..."
  },
  {
    "title": "Trump warns Supreme Court tariff showdown is 'life or death' for America",
    "description": "President Donald Trump said the Supreme Court’s upcoming tariff case will decide the fate of U.S. power, calling it “life or death\" for national and economi...",
    "opening": "NEW You can now listen to Fox News articles!\n\nPresident Donald Trump warned that the fate of the United States hangs in the balance ahead of Wednesday's hearing..."
  },
  {
    "title": "Donald Trump requests mistrial in rape accuser Carroll's civil case",
    "description": "NEW YORK — Donald Trump has requested a mistrial in a civil case where the writer E. Jean Carroll is accusing him of rape and defamation, claiming that the…",
    "opening": "This advertisement has not loaded yet, but your article continues below.\n\nAdam Zivo: The CBC has a unique obligation to be neutral, which it is failing\n\nColonia..."
  },
  {
    "title": "Kamala Harris, Donald Trump to debate Sept. 10, ABC says",
    "description": "ABC says both former U.S. president Donald Trump and U.S. Vice-President Kamala Harris have agreed to a Sept. 10 presidential debate, setting up a face-off betw...",
    "opening": "ABC says both former U.S. president Donald Trump and U.S. Vice-President Kamala Harris have agreed to a Sept. 10 presidential debate, setting up a face-off betw..."
  },
  {
    "title": "Jay Jones invokes Trump nearly 50 times during Virginia AG debate, ties Miyares to ‘MAGA’",
    "description": "Virginia Democratic attorney general candidate Jay Jones referenced Donald Trump 37 times during a debate with Republican Jason Miyares at the University of Ric...",
    "opening": "NEW You can now listen to Fox News articles!\n\nVirginia Democratic attorney general candidate Jay Jones appeared to come out swinging during a spirited debate at..."
  },
  {
    "title": "Joe Biden condemns attack on Donald Trump: 'We cannot allow this'",
    "description": "'We cannot allow this to be happening,' Joe Biden said. 'The idea that there's violence in America like this is just unheard of.'",
    "opening": "This advertisement has not loaded yet, but your article continues below.\n\nJoe Biden condemns attack on Donald Trump: 'We cannot allow this' 'We cannot allow thi..."
  },
  {
    "title": "Christie: Trump reruns would be worse than original show",
    "description": "HENNIKER, N.H. (AP) — Former New Jersey Gov. Chris Christie delivered his opening arguments against Donald Trump on Thursday, sounding like the prosecutor he?...",
    "opening": "“You’re not going to beat someone by closing your eyes, clicking your heels together three times and saying, ‘There’s no place like home.’ That’s no..."
  },
  {
    "title": "Democrats reexamine their social media game after losing to Trump: Not 'direct' or 'authentic'",
    "description": "Some Democrats are warning their party's leadership that Republicans won the election by using new media to reach independent voters more effectively, according...",
    "opening": "Some Democrats are warning their party's leadership that Republicans won the election by using new media, like podcasts and social media, more effectively to re..."
  },
  {
    "title": "Dems need to stop with 'existential threat' rhetoric about Trump: Former AG Barr",
    "description": "President Trump's former AG, William Barr, called on Democrats to end their rhetoric about Trump as an",
    "opening": "Former Attorney General William Barr told Fox News that \"the Democrats have to stop their grossly irresponsible talk about Trump being an existential threat to ..."
  },
  {
    "title": "Tim Scott: Trump is shifting 'Great Opportunity Party's' political paradigm, appealing to women, millennials",
    "description": "Sen. Tim Scott, R-S.C., joined 'Life, Liberty & Levin' to analyze the state of the presidential election, and dig into Trump's numbers with Black and youth vote...",
    "opening": "Join Fox News for access to this content Plus get unlimited access to thousands of articles, videos and more with your free account! Please enter a valid email ..."
  },
  {
    "title": "Black male voters tell MSNBC why Trump appeals to them: 'We're broke with Biden... with Trump, we had money'",
    "description": "MSNBC spoke with a focus group of Black male voters who shared why they might be considering a vote in favor of former President Trump over President Biden.",
    "opening": "A group of Black men spoke to MSNBC Friday about why former President Trump appeals to them over President Biden ahead of the 2024 presidential election.\n\nMSNBC..."
  },
  {
    "title": "What to know about the assassination attempt of Donald Trump",
    "description": "What began as a jubilant rally Saturday for Donald Trump days before he becomes the official Republican presidential nominee ended in mere minutes with the form...",
    "opening": "WASHINGTON (AP) — More details are emerging after former President Donald Trump survived an assassination attemp t Saturday, days before he becomes the offici..."
  },
  {
    "title": "Which Donald Trump will show up at Thursday night's CNN Presidential Debate?",
    "description": "It's the biggest question surrounding the first debate between President Biden and former President Trump in their 2024 election rematch — which version of Tr...",
    "opening": "It's the biggest question surrounding Thursday night's CNN Presidential Debate, which is the first of two on-stage showdowns between President Biden and former ..."
  },
  {
    "title": "Trump adviser Kellyanne Conway and anti-Trump husband George are divorcing",
    "description": "Observers questioned the state of their union after George began criticizing Trump with a fervor that matched his wife's support of Trump.",
    "opening": "Observers questioned the state of their union after George began criticizing Donald Trump with a fervor that matched his wife's support of the former president\n..."
  },
  {
    "title": "Trump asks Supreme Court to block release of Jan. 6 records",
    "description": "WASHINGTON (AP) — Former President Donald Trump turned to the Supreme Court Thursday in a last-ditch effort to keep documents away from the House committee in...",
    "opening": "FILE - President Donald Trump speaks during a rally protesting the electoral college certification of Joe Biden as President in Washington on Jan. 6, 2021. Form..."
  },
  {
    "title": "Donald Trump Jr. agrees to meet with House panel probing Jan. 6 Capitol attack -New York Times",
    "description": "Donald Trump Jr. has agreed to meet in the near future with the U.S. House of Representatives panel that is probing the Jan. 6, 2021, attack on the U.S.…",
    "opening": "Article content\n\nDonald Trump Jr. has agreed to meet in the near future with the U.S. House of Representatives panel that is probing the Jan. 6, 2021, attack on..."
  },
  {
    "title": "How Donald Trump won Iowa and where the votes came from",
    "description": "Trump performed strongly in rural communities. He won with white evangelical Christians and excelled among those without a college degree.",
    "opening": "This advertisement has not loaded yet, but your article continues below.\n\nHow Donald Trump won Iowa and where the votes came from Trump performed strongly in sm..."
  },
  {
    "title": "It's not just about Haley, DeSantis or Trump, this is a New Hampshire primary unlike any other",
    "description": "The New Hampshire primary falls on Tuesday, January 23. It does not feel like a typical primary. I've covered three primaries in the Granite State and this one ...",
    "opening": "Join Fox News for access to this content Plus get unlimited access to thousands of articles, videos and more with your free account! Please enter a valid email ..."
  },
  {
    "title": "Tiger Woods confirms his relationship with Vanessa Trump",
    "description": "'Love is in the air and life is better with you by my side! We look forward to our journey through life together,' Woods said on X",
    "opening": "'Love is in the air and life is better with you by my side! We look forward to our journey through life together,' Woods said on X\n\nKai Trump goes to the Benjam..."
  },
  {
    "title": "Michelle Obama would defeat Donald Trump by 11 points, poll finds",
    "description": "One in three Democrats believed Biden should drop out of the race, according to the poll.",
    "opening": "This advertisement has not loaded yet, but your article continues below.\n\nMichelle Obama would defeat Donald Trump by 11 points, poll finds One in three Democra..."
  },
  {
    "title": "Australian government distances itself from Donald Trump Jr.'s postponed tour",
    "description": "CANBERRA, Australia (AP) — Australia’s center-left government distanced itself Thursday from the postponement of Donald Trump Jr.’s speaking tour in Austr...",
    "opening": "This advertisement has not loaded yet, but your article continues below.\n\nFarmer's thumbs-up emoji reply to texted contract offer means he accepted it, must pay..."
  }
]